In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame()

In [4]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [57]:
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[2,7,3,23],[3,6,8,23],[23,23,63,12]],
                   index = list('abcde'),columns =["g","h","j","k"])

In [58]:
df1

    g   h   j   k
a   1   2   3   4
b   5   6   7   8
c   2   7   3  23
d   3   6   8  23
e  23  23  63  12

In [32]:
df1.head(3)

   g  h  j   k
a  1  2  3   4
b  5  6  7   8
c  2  7  3  23

In [33]:
df1.tail(2)

    g   h   j   k
d   3   6   8  23
e  23  23  63  12

In [34]:
df1

    g   h   j   k
a   1   2   3   4
b   5   6   7   8
c   2   7   3  23
d   3   6   8  23
e  23  23  63  12

In [35]:
df1.shape

(5, 4)

In [50]:
df2=df1.iloc[0:2,0:3]
df2[0]=4
df2

   g  h  j  0
a  1  2  3  4
b  5  6  7  4